import math
import tkinter as tk
print("Привет я бот который роднимет тебе настроние и подсчитает твои данные тела в будующем!")
lances = str(input("Ты хочешь этого? (отвечай да/нет) :"))
#аргумент
if lances == "да":
    print("Ок продолжаю")
elif lances == "нет" :
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    print("Ок закрой меня")
    printds
#переменные
name = (input("Как тебя зовут ? :"))
print(name.capitalize()+" у тебя очень красивое имя:)")
age = int(input("Сколько тебе лет? :"))
if age >= 18:
    print("О! Ты уже совершенно летний!")
    print(

    )
elif age < 18:
    print("Ты еше подросток или ребенок :)")
    print(

    )
rost = float(input("Каков твой рост в сантиметрах? :"))
print(

)
if rost >= 140.0:
    print("Так ты еще и высокий!")
    print(

    )
elif rost < 140.0:
    print("Хотя ты не высокий( НО У ТЕБЯ ОБЯЗАТЕЛЬНО НАЙДЕТСЯ ТАЛАНТ!")
    print(

    )
#заданный параметр
age += 1
rost += 5.25
#перевод
name = str(name)
age = str(age)
rost = str(rost)
#вывод текста
print("Подождите идет подсчет..")
print(("Подождите идет подсчет..."))
print("Подождите идет подсчет..")
print(

)
print(name+" через год тебе "+str(age)+" лет")
print(name+" да не пережевай, при норме роста ты вырастешь еше на "+str(rost)+" сантиметров")


















